{
  "backend/main.mo": "Motoko backend canister managing website content, draft/live publishing, and user profiles with access-control checks.",
  "feature_evidence.json": "Feature evidence report listing files, components, and tests relevant to the project’s deployment fix.",
  "frontend-file-summaries.txt": "Prewritten summaries describing each frontend file’s purpose and behavior.",
  "frontend/index.css": "Tailwind base styles defining warm OKLCH color variables for light and dark modes.",
  "frontend/index.html": "Main HTML entry including favicon, meta tags, dark mode class, and script mount point.",
  "frontend/src/App.tsx": "Root React component loading live content, rendering site sections, handling loading/errors, and mounting the editor dialog.",
  "frontend/src/components/admin/AccessDeniedScreen.tsx": "Error screen shown when the editor cannot load, advising the user to retry or refresh.",
  "frontend/src/components/admin/AdminEditor.tsx": "Full draft-content editor dialog with tabs, preview, image selection, and save/publish flows using anonymous backend hooks.",
  "frontend/src/components/admin/ChangeEditPasswordDialog.tsx": "Placeholder component for future password-change functionality.",
  "frontend/src/components/auth/LoginButton.tsx": "Internet Identity login/logout button with cache clearing on logout and retry on auth errors.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new authenticated users to enter and save their name during initial profile setup.",
  "frontend/src/components/common/LiveContentErrorState.tsx": "Displays an error message for failed content loading and provides retry and page refresh actions.",
  "frontend/src/components/navigation/HeaderNav.tsx": "Renders a responsive header with navigation links and an editor button, including a mobile menu toggle.",
  "frontend/src/components/sections/ContentSections.tsx": "Shows a content section with a title, body text, and three feature cards with icons.",
  "frontend/src/components/sections/Footer.tsx": "Displays footer text, branding link, and copyright year with dynamic tracking parameters.",
  "frontend/src/components/sections/HeroSection.tsx": "Renders a customizable hero layout with aligned text, optional image, and a Learn More button.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous actor, invalidating related queries when identity changes.",
  "frontend/src/hooks/useAdminAccess.ts": "Provides admin status based on authentication and an admin check query for backward compatibility.",
  "frontend/src/hooks/useAnonymousActor.ts": "Creates and caches a singleton anonymous actor using React Query.",
  "frontend/src/hooks/useAnonymousWebsiteContent.ts": "Provides hooks to load, update, and publish draft website content via the anonymous actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context with login, logout, identity loading, and status management.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating live content, user profiles, roles, and admin status via the actor API.",
  "frontend/src/index.css": "Defines Tailwind base styles and OKLCH color variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/heroLayout.ts": "Maps alignment and position values to Tailwind CSS classes for hero layout rendering.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL and sessionStorage parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, typography, animations, and plugins.",
  "project_state.json": "Tracks project metadata, issues, and deployment-failure context for build troubleshooting."
}