{
  "backend/main.mo": "Motoko canister defining website content types, access-controlled update functions, and user profile storage with admin and user permission checks.",
  "feature_evidence.json": "Empty feature evidence report placeholder containing no features.",
  "frontend-file-summaries.txt": "Text file listing summaries of various frontend source files for reference or documentation.",
  "frontend/index.css": "Tailwind base and custom CSS variables defining a warm color palette for light and dark modes.",
  "frontend/index.html": "HTML entry point setting dark mode, metadata, favicon, and loading the main React script.",
  "frontend/src/App.tsx": "Main React component that loads website content, renders sections, handles login state, and opens the admin editor dialog.",
  "frontend/src/components/admin/AccessDeniedScreen.tsx": "Displays a destructive alert and message when the editor fails to load.",
  "frontend/src/components/admin/AdminEditor.tsx": "Full editor dialog allowing anonymous content loading, editing, previewing, and saving with error handling and image selection.",
  "frontend/src/components/admin/ChangeEditPasswordDialog.tsx": "Empty placeholder component file for an edit-password dialog.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button managing Internet Identity authentication and clearing query cache on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new authenticated users to enter their name and save their profile with validation and error display.",
  "frontend/src/components/navigation/HeaderNav.tsx": "Responsive header navigation with site title, section scrolling, editor button, and mobile menu toggle.",
  "frontend/src/components/sections/ContentSections.tsx": "Renders a content section with title, body text, and three feature cards.",
  "frontend/src/components/sections/Footer.tsx": "Displays footer text, a link to caffeine.ai, and a copyright notice using the current year.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero section with configurable text and image alignment, scroll button, and preview mode handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and invalidates related queries when it changes.",
  "frontend/src/hooks/useAdminAccess.ts": "Legacy hook returning whether the authenticated caller is an admin along with auth state.",
  "frontend/src/hooks/useAnonymousActor.ts": "Provides a memoized anonymous backend actor via React Query.",
  "frontend/src/hooks/useAnonymousWebsiteContent.ts": "Fetches and updates website content using an anonymous actor with React Query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login, logout, and identity loading via a React context.",
  "frontend/src/hooks/useQueries.ts": "Collection of hooks for fetching and mutating website content, user profiles, roles, and admin status via the actor.",
  "frontend/src/index.css": "Sets Tailwind base layers and defines CSS variables for light/dark themes and global styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/utils/heroLayout.ts": "Provides helpers mapping alignment and position values to Tailwind utility classes.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL and sessionStorage parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, animations, and plugin integrations.",
  "project_state.json": "Defines project state, goals, and pending feature requests for persisting app data across upgrades."
}