{
  "backend/main.mo": "Motoko canister defining website content types, live/draft content storage, and admin-gated APIs for viewing and updating draft content and user profiles.",
  "feature_evidence.json": "Feature evidence report mapping features to involved frontend files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "Pre-generated summaries of frontend files describing functionality across hooks, components, utilities, and styling.",
  "frontend/index.css": "Tailwind-based global stylesheet defining warm color tokens for light/dark modes and applying base styles.",
  "frontend/index.html": "HTML entrypoint setting up metadata, favicon, dark mode, and loading the main React script.",
  "frontend/src/App.tsx": "Main React app loading live website content with error handling and optionally opening the admin editor dialog.",
  "frontend/src/components/admin/AccessDeniedScreen.tsx": "Component showing unauthenticated or unauthorized access messages with login and admin token instructions.",
  "frontend/src/components/admin/AdminEditor.tsx": "Admin-only editor dialog handling authentication checks, loading draft content, and enabling content editing and publishing.",
  "frontend/src/components/admin/ChangeEditPasswordDialog.tsx": "Non-functional placeholder component to satisfy TypeScript requirements for future password-change support.",
  "frontend/src/components/auth/LoginButton.tsx": "Renders a login/logout button using Internet Identity and clears queries on logout with error recovery for already-authenticated users.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Shows a modal prompting new authenticated users to enter and save their name, handling errors and loading states.",
  "frontend/src/components/common/LiveContentErrorState.tsx": "Displays an error message for failed live content loads with retry and page refresh options.",
  "frontend/src/components/navigation/HeaderNav.tsx": "Provides a responsive header with navigation links and an editor button, including a collapsible mobile menu.",
  "frontend/src/components/sections/ContentSections.tsx": "Displays a content section with a title, body text, and three feature cards with icons.",
  "frontend/src/components/sections/Footer.tsx": "Shows a footer with custom text, attribution link, and current year display.",
  "frontend/src/components/sections/HeroSection.tsx": "Renders a customizable hero layout with positioned text and an image, supporting preview mode.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAdminAccess.ts": "Returns whether the authenticated caller is an admin along with loading and error states.",
  "frontend/src/hooks/useAnonymousActor.ts": "Provides a singleton anonymous actor instance through a cached react-query hook.",
  "frontend/src/hooks/useAnonymousWebsiteContent.ts": "Contains hooks for fetching, updating, and publishing draft website content using the authenticated actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including loading, logging in, and clearing identities.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data such as content, user profiles, roles, and admin status.",
  "frontend/src/index.css": "Configures Tailwind base styles and CSS variables for light and dark themes with global styling rules.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/heroLayout.ts": "Maps backend alignment and position values to Tailwind utility classes and provides string conversion helpers.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, persisting, and clearing URL parameters and session storage values.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, container settings, animations, and plugin setup.",
  "project_state.json": "Metadata describing project state, features, and configuration for the Waxy Publisher project."
}