{
  "backend/main.mo": "Actor manages website content, user profiles, and access‑controlled updates using AccessControl and a migration mixin.",
  "backend/migration.mo": "Migration module resets website content to new defaults during upgrades while preserving other state.",
  "feature_evidence.json": "Empty feature evidence report placeholder.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of all frontend source files.",
  "frontend/index.css": "Tailwind base config defining warm color variables and dark‑mode overrides.",
  "frontend/index.html": "Base HTML document loading the React app with favicon and meta tags.",
  "frontend/src/App.tsx": "Main React app wiring authentication, content fetching, layout sections, profile modal, and admin editor.",
  "frontend/src/components/admin/AccessDeniedScreen.tsx": "Displays a destructive alert indicating lack of admin permissions.",
  "frontend/src/components/admin/AdminEditor.tsx": "Admin dialog for editing website content with permission checks, form state, and save handling.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with query cache clearing and error handling.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new authenticated users to enter their name and save their profile.",
  "frontend/src/components/navigation/HeaderNav.tsx": "Responsive header with smooth-scroll navigation, login button, and admin-only edit actions for mobile and desktop.",
  "frontend/src/components/sections/ContentSections.tsx": "Renders the content section with title, body text, and three feature cards.",
  "frontend/src/components/sections/Footer.tsx": "Displays footer text, attribution link, and current year branding.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero section with title, body, CTA button, and illustration image.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, reinitializing queries when identity changes.",
  "frontend/src/hooks/useAdminAccess.ts": "Returns whether the current authenticated user is an admin along with loading and error states.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity, managing login, logout, and identity restoration.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and updating website content, user profiles, roles, and admin status via the actor.",
  "frontend/src/index.css": "Tailwind CSS setup defining light/dark theme variables and base styles.",
  "frontend/src/main.tsx": "App entry point initializing React Query and Internet Identity providers before rendering App.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL and hash params, persisting them in sessionStorage, and clearing them when needed.",
  "frontend/tailwind.config.js": "Tailwind setup defining theme extensions, colors, typography, animations, and plugins.",
  "project_state.json": "Project metadata describing features, requirements, known issues, and customization goals for the website build."
}