{
  "backend/main.mo": "Main canister logic for website content and user profile management with admin-gated draft editing and publishing.",
  "backend/migration.mo": "Migration module converting old websiteContent state into new draft and live content fields.",
  "feature_evidence.json": "Feature evidence report linking feature IDs to affected frontend files and components with test references.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each major frontend file.",
  "frontend/index.css": "Global Tailwind CSS theme defining warm color variables and dark mode styles.",
  "frontend/index.html": "Base HTML document setting metadata, favicon, dark mode root class, and mounting the React app.",
  "frontend/src/App.tsx": "Public site entry component fetching live content and rendering main sections with an optional admin editor dialog.",
  "frontend/src/components/admin/AccessDeniedScreen.tsx": "UI component showing a generic error message when the editor cannot load.",
  "frontend/src/components/admin/AdminEditor.tsx": "Draft-content editor with tabs, form fields, saving, publish confirmation, and preview mode.",
  "frontend/src/components/admin/ChangeEditPasswordDialog.tsx": "Empty or placeholder dialog component for changing the edit password.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button integrating Internet Identity with query cache clearing on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new authenticated users to enter and save their name via profile query and mutation.",
  "frontend/src/components/navigation/HeaderNav.tsx": "Responsive header with site title, section scroll buttons, and an editor launcher for desktop and mobile.",
  "frontend/src/components/sections/ContentSections.tsx": "Static content section displaying a title, body, and three feature cards.",
  "frontend/src/components/sections/Footer.tsx": "Footer showing custom text, attribution link, and current year.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero banner with configurable text, image, alignment, and a scroll-to-content button.",
  "frontend/src/hooks/useActor.ts": "Creates an authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useAdminAccess.ts": "Legacy hook returning whether the authenticated caller is an admin.",
  "frontend/src/hooks/useAnonymousActor.ts": "Provides a singleton anonymous backend actor via React Query.",
  "frontend/src/hooks/useAnonymousWebsiteContent.ts": "Hooks for loading, updating, and publishing draft website content using the anonymous actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity authentication, login state, and stored identities.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks that load and mutate live content, user profiles, and roles using an actor from useActor.",
  "frontend/src/index.css": "Tailwind base styles with custom OKLCH color variables and dark mode tokens.",
  "frontend/src/main.tsx": "App entry point initializing React, Tailwind, Internet Identity, and React Query client.",
  "frontend/src/utils/heroLayout.ts": "Utility functions mapping alignment and position values to Tailwind CSS classes for hero layouts.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL parameters and session-stored values.",
  "frontend/tailwind.config.js": "Tailwind configuration defining colors, typography, container settings, animations, and plugins.",
  "project_state.json": "Project metadata describing current features, pending requests, architectural notes, and versioning."
}