{
  "kind": "build_request",
  "title": "Remove admin-only restriction so anyone can edit site content",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the backend so updating website content is no longer restricted to administrators (any caller, including anonymous, can call updateWebsiteContent successfully).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Its now saying only admins can editt"
        ]
      },
      "acceptanceCriteria": [
        "Calling updateWebsiteContent as a non-admin principal does not trap with an 'Only admins' / unauthorized error.",
        "Calling updateWebsiteContent without Internet Identity (anonymous actor) succeeds and persists the new WebsiteContent.",
        "getWebsiteContent returns the updated content after a successful update."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the editor UI flow so it no longer blocks editing based on admin status or shows an 'Only administrators can edit' access-denied state.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Its now saying only admins can editt"
        ]
      },
      "acceptanceCriteria": [
        "Opening the editor from the \"Edit Site\" button does not show an access denied screen for non-admin users.",
        "Saving from the editor succeeds for non-admin users and updates the visible site content after save.",
        "No user-facing text in the editor mentions that only administrators can edit site content."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Remove/disable frontend admin-status queries and initialization behaviors that are only needed for admin-gated editing, so the app does not depend on admin checks for the edit flow.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Its now saying only admins can editt"
        ]
      },
      "acceptanceCriteria": [
        "The edit flow works end-to-end without requiring isCallerAdmin to be true.",
        "The editor does not require a caffeineAdminToken URL parameter to function for non-admin users.",
        "No React Query calls used solely to gate editing by admin status are required for the editor to open and save successfully."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo.",
    "Do not edit files under frontend/src/components/ui (compose them instead).",
    "Do not edit frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui."
  ],
  "nonGoals": [
    "Adding role-based permissions or an alternative authorization system for editing.",
    "Implementing third-party authentication providers beyond Internet Identity.",
    "Adding real-time collaborative editing."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}