{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix admin editor authentication and access messaging for draft editing",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Switch the admin editor draft load/save/publish flows to use an authenticated backend actor (Internet Identity) for admin-only draft capabilities, with clear save success feedback and live refresh after publish.",
      "acceptanceCriteria": [
        "When a signed-in admin opens the editor, draft content loads without an Unauthorized trap.",
        "Saving updates the draft content and shows a clear success confirmation.",
        "Publishing still works and refreshes the live site content after success (no content edits required to publish)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useAnonymousWebsiteContent.ts",
          "operation": "modify",
          "description": "Refactor draft-content hooks to call draft admin-only backend capabilities via the authenticated actor from useActor (instead of the anonymous actor), including keeping the existing React Query invalidation/refetch behavior so publish refreshes live content. Verify the selected component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/admin/AdminEditor.tsx",
          "operation": "modify",
          "description": "Update AdminEditor to use the authenticated-actor draft hooks for loading, saving, and publishing draft content (replacing the anonymous-actor draft hooks), preserving existing save success confirmation and publish success handling. Verify the selected component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Provide explicit editor access messaging for unauthenticated and non-admin users, including guidance to sign in with Internet Identity and/or supply the admin secret token via the existing URL-parameter mechanism.",
      "acceptanceCriteria": [
        "Opening the editor while not signed in prompts the user to sign in (or otherwise clearly indicates authentication is required).",
        "Opening the editor while signed in but lacking admin permission shows an explicit authorization/access-denied message (not a generic 'Unable to Load Editor').",
        "All user-facing text is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/AccessDeniedScreen.tsx",
          "operation": "modify",
          "description": "Expand AccessDeniedScreen into a reusable access/authorization message UI that can render (a) an authentication-required message with an embedded Internet Identity sign-in action (compose existing LoginButton), and (b) an access-denied message with instructions to provide the admin secret token using the existing caffeineAdminToken URL hash parameter mechanism; keep all text English. Verify the selected component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/admin/AdminEditor.tsx",
          "operation": "modify",
          "description": "Detect unauthenticated vs. unauthorized (non-admin) conditions before/while attempting draft load (using Internet Identity state plus existing admin checks) and render the updated AccessDeniedScreen instead of the current generic load-failure dialog for these cases; keep generic error UI only for non-auth-related failures. Verify the selected component's usage instructions before implementing."
        }
      ]
    }
  ]
}