{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix frontend build/deploy blockers and improve deploy-time diagnostics",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Remove frontend compilation blockers and improve runtime error visibility so standard build/deploy completes cleanly and failures are actionable.",
      "acceptanceCriteria": [
        "Running the standard build produces no Motoko compilation errors for the backend canister.",
        "Running the standard build produces no TypeScript/Vite compilation errors for the frontend.",
        "A full deploy completes successfully (backend + frontend) without runtime traps during initialization.",
        "If the deployment fails again, surface the exact failing step and error output in logs so it is actionable to fix."
      ],
      "file_operations": [
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Align TypeScript declarations with the actor methods used by the frontend by adding the missing access-control initialization function used in frontend/src/hooks/useActor.ts (e.g., declare the secret-based initialization method on backendInterface). This prevents TypeScript/Vite compilation failures caused by calling an undeclared backend capability."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Eliminate any brittle/incorrect UI import paths that can break Vite/TypeScript builds (e.g., prefer importing Toaster from the installed 'sonner' package rather than relying on an alias-based '@/components/ui/sonner' shim). Keep user-facing text in English."
        },
        {
          "path": "frontend/src/components/common/LiveContentErrorState.tsx",
          "operation": "modify",
          "description": "Improve error surfacing to make failures actionable by logging a structured error (message + stack + any available cause) to the console and presenting a clearer error summary for users while keeping all user-facing text in English."
        },
        {
          "path": "frontend/src/components/admin/AdminEditor.tsx",
          "operation": "modify",
          "description": "Harden editor error handling so draft load/save/publish failures provide actionable diagnostics in logs (console) without changing features (e.g., include underlying error message details where safe). Ensure generated image choices remain valid and reference existing public assets (frontend/public/assets/generated/hero-illustration.dim_1600x900.png, frontend/public/assets/generated/hero-illustration-alt-1.dim_1600x900.png, frontend/public/assets/generated/hero-illustration-alt-2.dim_1600x900.png, frontend/public/assets/generated/hero-illustration-alt-3.dim_1600x900.png). Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}